OdGsReactor.gsToBeUnloaded(OdGsModule*)
\details
Notification function called whenever an OdGsModule object is about to be unloaded.
\param pModule [in]  Pointer to the OdGsModule object.
\remarks
This function is called after the operation.

OdGsReactor.viewWasUpdated(OdGsView*,System.Int32)
\details
Notification function called after OdGsView properties are updated.
\param pView [in]  Pointer to the OdGsView object.
\param flags [in]  Bitcoded flags of type ViewUpdateFlags depending on which properties are effected.

OdGsReactor.viewToBeUpdated(OdGsView*,System.Int32)
\details
Notification function called before OdGsView properties are updated.
\param pView [in]  Pointer to the OdGsView object.
\param flags [in]  Bitcoded flags of type ViewUpdateFlags depending on which properties are effected.

OdGsReactor.viewToBeDestroyed(OdGsView*)
\details
Notification function called whenever an OdGsView object is about to be destroyed.
\param pView [in]  Pointer to the OdGsView object.
\remarks
This function is called before the operation.

OdGsReactor.viewWasCreated(OdGsView*)
\details
Notification function called whenever a OdGsView object has been created.
\param pView [in]  Pointer to the OdGsView object.
\remarks
This function is called after the operation.